app/views/comments/_comment.html.erb


  <span><%=link_to User.find(comment.user_id).name,comment.user %></span><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  <span class="timestamp">
    Posted <%= time_ago_in_words(comment.created_at) %> ago.

---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "sadf"], ["user_id", 1], ["post_id", 295], ["created_at", "2017-11-08 04:43:06.313695"], ["updated_at", "2017-11-08 04:43:06.313695"]]