app/views/users/show_follow.html.erb

      <span><%= link_to "view my profile", @user %></span>
      <span><b>posts:</b> <%= @user.posts.count %></span>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]