app/views/shared/_like_form.html.erb

<% if @post.likes.find_by(user_id: current_user.id)%>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 304], ["LIMIT", 1]]


  <p class="likes"><%=	 @post.likes.count %></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 259]]