app/views/posts/_post.html.erb

  <span class="timestamp">
    Posted <%= time_ago_in_words(post.created_at) %> ago.

---
INSERT INTO "posts" ("content", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "ssss"], ["title", "aaaaaaaaaa"], ["user_id", 1], ["created_at", "2017-11-08 12:48:19.419419"], ["updated_at", "2017-11-08 12:48:19.419419"]]