app/views/posts/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 301]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 295]]
---
<h1><%= @post.content %></h1>
<p>Tags: <%= 	@post.tags.map(&:name).map {|t| link_to t, tag_path(t)}.join(",").html_safe  %></p>
<div class="col-md-8">
    <% if @post.comments.any? %>