app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 303], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "aaaaaaaaaaaa"], ["user_id", 1], ["post_id", 304], ["created_at", "2017-11-08 03:33:39.336477"], ["updated_at", "2017-11-08 03:33:39.336477"]]
---
	def create
		@post = Post.find(params[:post_id])

		@comment = @post.comments.build(comment_params)
		@comment.user_id = current_user.id
		if @comment.save