app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 295], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" DESC  [["post_id", 295]]
---
	def show
		@post = Post.find(params[:id])
		@comment = @post.comments.build
		@comments = @post.comments.all

INSERT INTO "posts" ("content", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		@post = current_user.posts.new(post_params)
		if @post.save

SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "adsf"], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 2]]
---
	def index
		if params[:tag]
      		@tag = Tag.find_by(name: params[:tag])
      		@post = Post.tagged_with(params[:tag]).paginate(page: params[:page], per_page: 20)