app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES (?, ?, ?)  [["password_digest", "$2a$10$4LW1ry.kzaWvCdhbQFPLG.vvqZuH1LE9WWKREZyd1XqkedY36ei.G"], ["created_at", "2017-11-06 12:10:06.687564"], ["updated_at", "2017-11-06 12:10:06.687564"]]
---
  def create
  	@user = User.new(user_params)
  	if @user.save